[
    {
        "id": 1,
        "name": "Dragon Ball",
        "image": "dragon-ball.jpg",
        "sagas": {
            "saga1": {
                "saga_name": "Dragon Ball Saga",
                "description": "La historia comienza en la Montaña Baozi, con un niño que tiene una cola de mono llamado Son Goku. Fue encontrado por un maestro de artes marciales llamado Son Gohan. Fue adoptado por él como su nieto y entrenado para llegar a ser un gran luchador. Tras la muerte de su abuelo adoptivo, Goku vive solo en la montaña y guarda como único recuerdo de su abuelo la esfera del dragón de cuatro estrellas que le dio antes de morir. Un día, después de terminar de cortar madera, Goku entró en su casa y vió brillar su esfera del dragón, y pensó que era su abuelo intentando hablarle. Luego salió en busca de comida, pero se encontró con un tigre dientes de sable que lo persigue hasta caer en un rio. Una vez que Goku salió del río, se quitó la ropa dejando que secase y se puso a pescar, por lo que metió su cola en el agua para usarla como cebo. Posteriormente un pez gigantesco vio su cola y pensó que era un mono, así que fue rápidamente hacía él, pero Goku lo noqueó de una patada. Después, Goku fue arrastrando el pez hacía su casa, pero en el trascurso fue atropellado por el coche de una adolescente llamada Bulma. Goku nunca había visto antes un coche, y pensó que era un monstruo. Entonces, lo agarró y lo lanzó a bastante distancia. En defensa propia, Bulma sacó una pistola y le disparó, pero debido a la gran fuerza y resistencia de Goku, las balas apenas le hicieron un poco de daño. Luego, Bulma sale del coche y se presenta como una chica humana, y no como un monstruo (como pensaba Goku). Después, Goku invita a Bulma a su casa (ya que su abuelo le había dicho que había que ser amable con las chicas) y Bulma ve la esfera del dragón de cuatro estrellas. Después de esto, Bulma le cuenta toda la historia de las Esferas del Dragón, relatando que al juntar las 7 esferas, Shen Long saldrá y le concederá cualquier deseo al que lo haya invocado. En ese momento, se cambia la escena y se nos muestra por primera vez a la Banda de Pilaf, los cuales entran en un templo para encontrar la Esfera del Dragón de una estrella. Bulma le comenta a Goku que quiere reunir las esferas para pedir un novio, pero Goku no quiere darle su esfera, al ver esto, Bulma intenta sobornar a Goku para que le entregue su esfera, a cambio, ella dejará que él le toque sus bragas, pero este no quiere. Al final, Bulma termina convenciendo a Goku de que la acompañe a buscar las demás esferas del dragón. Bulma le dice a Goku que con el Radar del Dragón podrán encontrar el resto de las esferas y le explica como funciona, aunque este no entiende nada; luego saca una pequeña capsula que al apretar un botón y lanzarla, explota y sale una moto, Goku queda y sorprendido y cree que ella es una bruja, pero esta le explica que en realidad es una cápsula. Al rato, hacen una parada para que Bulma vaya a orinar pero es capturada por un Pteranodon; Goku, que no entiende lo que esta sucediendo cree que el Pteranodon es un amigo de Bulma y se deja amarrar a un árbol, luego de entender todo, este se monta en la moto y sale persiguiendo al animal. Goku hace volar la moto al saltar por una colina y logra llegar a la altura del Pteranodon, que muere al recibir un gran golpe en la cabeza con el Báculo Mágico de Goku. Salvando así a Bulma. Con esto comenzarían enormes aventuras, enfrentando a poderosos enemigos y haciendo nuevos amigos."
            }
            
        }
    },
    {
        "id": 2,
        "name": "Dragon Ball Z",
        "image": "dragon-ball-z.jpg",
        "sagas": {
            "saga1" : {
                "saga_name": "Saga de los Saiyajin",
                "description": "Dragon Ball Z retoma cinco años después del final del anime Dragon Ball, con Goku ahora un adulto joven y padre de su hijo, Gohan. Un extraterrestre humanoide llamado Raditz llega a la Tierra en una nave espacial y rastrea a Goku, revelándole que es su hermano mayor perdido hace mucho tiempo y que son miembros de una raza guerrera alienígena casi extinta llamada Saiyajin (サイヤ人, Saiya-jin) (conocido como 'Saiyan' en España). Los Saiyajin enviaron a Goku (originalmente llamado Kakaroto [カカロット, Kakarotto]) a la Tierra cuando era un bebé para conquistar el planeta para ellos, pero sufrió un fuerte golpe en la cabeza poco después de su llegada, y perdió todo recuerdo de su misión, así como su naturaleza Saiyajin sedienta de sangre. Raditz, junto con dos élites, Vegeta y Nappa, son los únicos guerreros Saiyajin que quedan, por lo que Raditz busca la ayuda de Goku para conquistar mundos fronterizos. Cuando Goku se niega a unirse a ellos, Raditz derriba a Goku y a Krillin de un solo golpe, secuestra a Gohan y amenaza con asesinarlo si Goku no mata a 100 humanos en las próximas 24 horas. Goku decide formar equipo con su archienemigo Piccolo, quien también fue derrotado por Raditz en un encuentro anterior, para derrotarlo y salvar a su hijo. Durante la batalla, la ira de Gohan lo hace momentáneamente más fuerte que Piccolo y Goku mientras ataca a Raditz para proteger a su padre. La batalla termina con Goku sujetando a Raditz por la espalda para que Piccolo pueda golpearlos con un movimiento mortal llamado Makankosappo (魔貫光殺砲, Makankōsappō, literalmente 'Demonio Atravesante, Rayo Asesino'), hiriendo mortalmente a ambos y matándolos casi al mismo tiempo después de un rato. Pero antes de que Raditz sucumba a sus heridas, le revela a Piccolo que los otros dos Saiyajin son mucho más fuertes que él y que vendrán por las Esferas del Dragón (conocidas como 'Bolas del Dragón' en España) en un año. Habiendo sido testigo del potencial latente de Gohan, Piccolo lo lleva al desierto para entrenarlo para la próxima batalla contra los Elites Saiyajin. En el más allá, Goku viaja por el Camino de la Serpiente de un millón de kilómetros para poder entrenar bajo el mando del gobernante de la Galaxia del Norte, Kaiosama (conocido como 'Kaito' en España). Kaiosama le enseña las técnicas Kaio-ken (界王拳, Kaiōken, literalmente 'Puño de los reyes de los mundos') y Genkidama (元気玉, Genki Dama, literalmente 'Esfera de energía'). A pesar de su naturaleza brusca, Piccolo se encariña con Gohan mientras lo supervisa aprendiendo a valerse por sí mismo. Esto forja un vínculo emocional improbable entre los dos. Pasado un año Goku revive con las Esferas del Dragón, pero Kaiosama entra en pánico cuando se da cuenta de que Goku tendrá que volver a ir por el Camino de la Serpiente nuevamente para regresar y no lo logrará hasta horas después de que lleguen los Saiyajin. Los aliados de Goku se agrupan para luchar hasta que Goku regrese, pero demuestran no ser rival para Nappa y el 'Príncipe de todos los Saiyajin', Vegeta. Yamcha, Ten Shin Han, Chaoz y Piccolo mueren en la batalla, y la muerte de Piccolo hace que tanto Kami Sama como las Esferas del Dragón desaparezcan. Cuando Goku finalmente llega al campo de batalla, venga a sus amigos caídos al derrotar fácilmente a Nappa antes de paralizarlo al partirle la columna por la mitad. Vegeta, furioso, ejecuta a Nappa por no haber matado a Goku. Goku usa varios grados del Kaio-ken para ganar el primer enfrentamiento con Vegeta, que concluye con una lucha culminante de choques de Kamehameha y Galick Ho respectivamente, pero tiene un gran costo para su cuerpo. Vegeta regresa y crea una luna artificial para transformarse en un gran mono Ozaru (similar a Goku de niño cuando tenía cola), que usa para torturar a Goku. Krillin y Gohan sienten que Goku está en problemas y regresan para una pelea grupal con el ahora aparentemente imparable Vegeta. Son ayudados en momentos clave por Yajirobe, quien corta la cola de Vegeta para que vuelva a su estado normal. Goku le da a Krillin una genkidama que él hizo, y Krillin la usa para dañar severamente a Vegeta. Vegeta finalmente es derrotado cuando es aplastado por la forma Ozaru de Gohan (quien había visto la luna artificial de Vegeta), y se retira a su nave espacial cuando Krillin se acerca para acabar con él con la espada de Yarijobe. Goku convence a Krillin para que perdone la vida de Vegeta y le permita escapar de la Tierra, con Vegeta prometiendo regresar y destruir el planeta en venganza por su humillación a manos de Goku."
            },
            "saga2": {
                "saga_name": "Saga de Freezer",
                "description": "Durante la batalla, Krillin escucha a Vegeta mencionar el conjunto original de las Esferas del Dragón del planeta natal de Piccolo, Namekusei (ナメック星, Namekku-sei). Mientras Goku se recupera de sus heridas, Gohan, Krillin y la amiga más antigua de Goku, Bulma, parten hacia Namek para usar estas esferas para revivir a sus amigos asesinados. A su llegada a Namekusei, Krillin, Gohan y Bulma descubren que Vegeta y su superior, el tirano galáctico Freezer, ya están allí, cada uno buscando usar las Esferas del Dragón para obtener la inmortalidad. Vegeta es más fuerte que antes, ya que los Saiyajin se vuelven más fuertes cuando se recuperan al borde de la muerte, por lo que aprovecha la oportunidad para rebelarse contra Freezer. Se produce un juego triangular del gato y el ratón, en el que Freezer, Vegeta y Gohan con Krillin poseen alternativamente una o más de las esferas, y nadie logra poseer las siete en un momento dado.Vegeta logra aislar a los lugartenientes de Freezer uno por uno y los mata. Cuando Freezer ve que Vegeta está planteando un problema demasiado grande, convoca a las Fuerzas Especiales Ginyu, un equipo de 5 mercenarios de élite dirigido por el Capitán Ginyu, que puede cambiar de cuerpo con sus oponentes, y 4 miembros más, entre ellos Recoome, un grandullón de cabello naranja rojizo bastante fuerte, Burdo, un enano verde de 4 ojos capaz de congelar el tiempo a voluntad, y así fingir moverse instantáneamente, Jeace, miembro rojo que junto a Burter, el miembro azul, pueden formar la técnica de 'Los Cometas Relampagueantes'. Vegeta se une a regañadientes con Gohan y Krillin para luchar contra ellos, sabiendo que son demasiado para él solo. Los miembros de Las Fuerzas Ginyu resultan demasiado poderosos, pero Goku finalmente llega y los derrota sin ayuda, salvando a Vegeta, Gohan y Krillin. Vegeta cree que Goku puede haberse convertido en el guerrero legendario de los Saiyajin, el Súper Saiyajin (超スーパーサイヤ人, Sūpā Saiya-jin). Mientras Goku se recupera en una de las máquinas regeneradoras en la nave de Freezer, luego de la pelea brutal que tuvo con el Capitán Ginyu, a la par que Vegeta está ahí tomando un descanso, Krillin, Dende y Gohan usan en secreto las Esferas del Dragón a espaldas de Vegeta para desear la resurrección de Piccolo y teletransportarlo a Namekusei. Vegeta los encuentra usando las esferas sin él, pero el Gran Patriarca muere y deja las esferas inertes y convertidas en piedra, antes de que Vegeta pueda desear la inmortalidad. Justo cuando esto sucede, Freezer llega y estando muy enfurecido, decide matar a los cuatro por negarle su deseo de inmortalidad. Piccolo llega a Namekusei, pero está accidentalmente lejos de los demás, debido a un deseo mal redactado. Encuentra al guerrero namekiano más fuerte, Nail, que fue derrotado por Freezer, dejándolo al borde de la muerte, y le pide a Piccolo que se fusione con él para aumentar considerablemente su poder. A pesar de los avances de poder de Piccolo y Vegeta, Freezer los supera en gran medida, quien pasa por varias transformaciones antes de alcanzar su forma final, que luego usa para matar a Dende, luego de haberse dado cuenta que él era de los pocos namekianos en tener poderes curativos. Posteriormente Freezer decide torturar a Vegeta, haciéndolo sufrir peor que en el infierno según palabras de Freezer, hasta casi matarlo. Goku llega después de curarse de sus heridas, y Vegeta quién primeramente se burla de Freezer por estar frente a su mayor miedo, que es el Super Saiyajin, se molesta por lo dicho por Vegeta, y le dispara un rayo al corazón, dejándolo en estado de agonía. Vegeta le dice a Goku que Freezer fue quien destruyó el planeta natal de los Saiyajin (es decir el Planeta Vegeta) y masacró a la raza Saiyajin dn conjunto al planeta, ya que temía que algún día sería derrotado por un Súper Saiyajin. Así mismo, Vegeta finalmente muere en frente de Goku, y este último cava con el poder de sus ojos un hueco para enterrar a Vegeta, y aclamando que quiere compartir el orgullo de Vegeta con él, Goku admite que es un saiyajin criado en la tierra, y procurará vengar a todos los saiyajin y namekianos asesinados por Freezer, proclamando que jurará exterminar al emperador del universo. Aunque el poder de Goku supera al de Vegeta, todavía no es rival para Freezer. Goku usa su último recurso, una genkidama masiva con la energía de Namekusei y los mundos circundantes, y aparentemente derrota al tirano. Sin embargo, Freezer logra sobrevivir y desata su ira sobre el grupo al herir gravemente a Piccolo y asesinar a Krillin. La ira de Goku con este último acto, finalmente estalla y sufre una extraña transformación que vuelve su cabello rubio, sus ojos celeste verdoso (o color aguamarina) y hace que un aura dorada irradie de su cuerpo. Goku finalmente se ha convertido en un Súper Saiyajin. Mientras tanto, el revivido Kami Sama usa las Esferas del Dragón de la Tierra para resucitar a todos los que fueron asesinados por Freezer y sus secuaces en Namekusei, lo que también permite que el Gran Patriarca resucite por un corto periodo de tiempo y que el dragón namekiano Porunga regrese. Dende usa el último deseo para teletransportar a todos en Namekusei a la Tierra excepto a Goku y Freezer. Incluso al 100% de su poder, Freezer no demuestra ser rival para la transformación del Super Saiyajin, y Goku de un momento a otro decide renunciar, cosa en la que Freezer se niega y enfurece, por lo que decide lanzarse un kienzan (técnica también de Krillin para cortar cosas y personas), posteriormente Goku intenta aconsejar a Freezer que si quiere acabar más rápido con la pelea, debe de mejorar su técnica y elevar su energía, cosa que Freezer lo malentiende, y le lanza a Goku 2 kienzan, y por esa decisión obstinada de Freezer, provoca que uno de esos kienzan lo corte a la mitad, dejándolo gravemente herido, y siendo reclamado por Goku por provocar su propia derrota, justo antes de que Goku tratara de escapar del planeta, Freezer muy gravemente herido, le pide ayuda a Goku, pidiéndole misericordia, cosa que a Goku le parece muy hipócrita y descarado por parte de Freezer, por lo que lo regaña por esa petición, ya que él nunca le tuvo perdón o misericordia a quienes hacía sufrir, pero antes de pensarlo 2 veces, Goku le da un poco de su energía a Freezer, para que él también pueda huir del planeta antes de su explosión, y así también sepa valorar verdaderamente a la vida, Freezer le recalca a Goku que no tiene escapatoria alguna, y que a diferencia de él, Freezer sí puede sobrevivir en el espacio, así Goku decide retirarse diciéndole a Freezer que él también sobrevivirá. No obstante, Freezer al ver a Goku volando para retirarse de Namekusei, recuerda toda la humillación que le hizo desde que lo vio por primera vez cuando torturaba a Vegeta, así Freezer trata de acabar con Goku por la espalda, pero Goku al percatarse de que Freezer no aprendió lo que él le dijo, decide derrotar al malvado tirano de una vez por todas antes de escapar de Namekusei, sintiendo pena por Freezer por carecer de comprensión de los buenos consejos que Goku le trato de dar. Goku trata de huir del planeta en la nave de Freezer, sin embargo el motor de la misma fue destruido anteriormente por Vegeta, haciendo que no pudiera arrancar, y cayera en el fondo de la lava derretida del planeta, haciendo que Goku no tenga otra alternativa para escapar, justo cuando el planeta es destruido en una explosión masiva."
            },
            "saga3": {
                "saga_name": "Saga de los Androides y Cell",
                "description": "Un año después, se revela que Freezer sobrevivió y llega a la Tierra con su padre, el Rey Cold, en busca de venganza hacia Goku. Sin embargo, aparece un joven misterioso llamado Trunks, quien se transforma en un Super Saiyajin, acabando poco a poco con todos los guardias de Cold, posteriormente mata a Freezer y al Rey Cold sin piedad alguna. Goku regresa unas 3 horas más tarde, después de haber pasado el último año en el planeta alienígena Yadrat aprendiendo una nueva técnica: La Teletransportación, que le permite transportarse a cualquier lugar que desee detectando la presencia no de un lugar sino de una persona. Trunks le revela en privado a Goku que es hijo de Vegeta y Bulma, y ​​que ha viajado 17 años en el futuro para advertirle a Goku que aparecerán dos androides (人造人間, Jinzōningen, literalmente 'Humanos artificiales') creados por el Dr. Gero, en tres años para buscar venganza contra Goku por destruir el Ejército de la Patrulla Roja (conocido como 'Lazo Rojo' en España) cuando era un niño. Trunks dice que todos los amigos de Goku caerán ante ellos, mientras que el propio Goku morirá de un virus al corazón seis meses antes de su llegada. Trunks le da a Goku una medicina del futuro que lo salvará del virus del corazón y regresa a su respectiva línea del tiempo. Cuando llegan los androides, Goku se enferma durante su pelea con el Androide 19, pero Vegeta lo salva, quien revela que también logró la transformación del Super Saiyajin. Vegeta y Piccolo derrotan fácilmente al Androide 19 y al Dr. Gero (quien se convirtió en el 'Androide 20'), pero Trunks regresa del futuro para verificar su progreso y revela que los androides que derrotaron no son los que los mataron a todos en el futuro. Goku está en cuidados intensivos por parte de Chi-Chi y Yamcha, mientras sus aliados están abrumados por la llegada de los Androides 16, 17 y 18, mientras que un bio-Androide aún más fuerte llamado Cell emerge de una línea de tiempo diferente y se embarca en una búsqueda para encontrar y absorber a los Androides 17 y 18, que le permitirá alcanzar su 'forma perfecta'. Cell absorbe con éxito al Androide 17, volviéndose considerablemente más poderoso, pero Vegeta regresa a la batalla, habiendo aumentado mucho su poder, y lo domina fácilmente. Sin embargo, Vegeta permite que Cell absorba a Androide 18, creyendo que su 'forma perfecta' no será rival para su poder de Super Saiyajin, aunque más que nada deja que Cell absorba a 18 por haber humillado a Vegeta anteriormente, fracturando su brazo izquierdo. Posteriormente, Vegeta es derrotado y Cell le agradece sarcásticamente por ayudarlo a lograr la perfección. Cell permite que todos vivan por el momento y anuncia su torneo de lucha para decidir el destino de la Tierra, conocido como los 'Juegos de Cell'. Goku, recuperado del virus del corazón y habiendo alcanzado el cenit de la forma Super Saiyajin, se enfrenta a Cell en el torneo. Goku finalmente se da cuenta de que Cell es demasiado poderoso para que él lo maneje y pierde la pelea ante el asombro de todos los demás. Goku proclama que Gohan podrá derrotar a Cell. Aunque inicialmente es superado, Gohan finalmente puede aprovechar su poder latente, desatando su furia, y logrando la transformación Super Saiyajin 2, después de que el Androide 16 se sacrifique en un intento fallido de matar a Cell. Negándose a aceptar la derrota, a la par que Gohan hiciera que Cell expulsara a la Androide 18, Cell se prepara para autodestruirse y consigo así destruir la Tierra. Goku usa su habilidad de la teletransportación para transportarse a sí mismo y a Cell al planeta de Kaiosama, donde Cell explota y mata a todos los que están allí. Sin embargo, gracias al núcleo que tiene en su cabeza, el cual permaneció intacto en la explosión, Cell sobrevive a dicha explosión y regresa a la Tierra más poderoso que nunca, donde rápidamente asesina a Trunks, provocando la furia de Vegeta por ello, pero Gohan libera la totalidad de su poder en una ola masiva de Kamehameha, y con la ayuda de algunos de los amigos de Goku, como Piccolo, Yamcha, Ten Shin Han, incluso en parte Vegeta, logran distraer a Cell, y de esa manera, Gohan destruye a Cell de una vez y para siempre. Luego, los Guerreros Z usan las Esferas del Dragón para revivir a todos los que fueron asesinados por Cell, incluido Trunks, mientras que Goku elige permanecer en el Otro Mundo, rechazando una oferta de sus amigos de usar las Esferas del Dragón de la tierra y de Namekusei para traerlo de regreso. Trunks regresa a su línea de tiempo y usa su poder reforzado para finalmente mamar a los Androides 17 y 18 en el futuro, y 3 años después en esa línea temporal, también termina derrotando a Cell del futuro, restableciendo de esa manera la paz en el futuro, y agradeciendo desde ahí, a Goku y sus amigos por toda la ayuda. Posteriormente en el presente, Goku está ansioso por querer ir a combatir con otros peleadores del Otro Mundo, cosa que Kaiosama no quiere hacer, más que nada por el temor de que los otros Kaiosamas se burlen de su muerte y de su aureola."
            },
            "saga4": {
                "saga_name": "Saga de Majin Boo",
                "description": "Varios años después de la gran batalla contra Cell, la historia de la última saga se inicia, Gohan es un joven ya, ahora tiene un hermano llamado Goten, que es casi igual a Goku de niño, el Trunks actual es un niño un poco mayor, el Trunks del futuro regresa a su tiempo, Vegeta se ha vuelto más poderoso y más agresivo que antes, Goku ahora esta en el cielo pero desde ahí puede bajar de vez en cuando a la Tierra, La Androide 18 es ahora humana por un deseo pedido al dios Dragon por Krillin y tienen una hija. Pareciera que ya no queda ningún enemigo en la Tierra que puede derrotar ahora al poderoso Gohan o a Vegeta, una vez destruido Cell, termina una saga que se inicio desde el comienzo de la serie, la lucha contra la Armada Cinta Roja (Red Ribbon), primero en Dragon Ball cuando Goku niño derrota a su ejercito y al mayor enemigo humano que enfrenta el asesinó Tao Pai Pai, despúes en Dragon Ball Z con el Dr. Gero con sus robots y androides que terminaron en la creación de Cell, creado para derrotar a Goku, pero una vez destruido Cell ya nada en la Tierra es capaz de derrotar a los Saijayins, además ya habían destruido al que creian el más poderoso enemigo del Universo, Freeza, pero ahora enfrentarán a su mayor amenaza, a un ser que tiene el máximo poder y que ha estado dormido por millones de años : Majin Boo. Pero esta historia se inicia de 75-50 millones de años antes de nacer Kakaroto (Goku) ocurren 2 hechos importantes: El mago Bibidí creó a Majin Boo, el cual comenzó a destruír planetas.Absorbió a 2 de los 5 Kaioh Shin del universo, eliminó a otros 2. Por eso, Bibidí lo encerró en una esfera que se esconde en la tierra. Pero como el último Kaioh Shin eliminó a Bibidí, la esfera fue olvidada.*Ro Kaito (el último Kaioh Shin) esencerrado en la espada Z. Comenzó el 25° torneo de las Artes Marciales. Goku regresa al mundo de los vivos por 1 día. Bibidi ayudado por otro extraterrestre llamado Dabura se propone liberar a Majin Boo, para esto busca a los mejores peleadores del universo y toma parte de ellos para integrarlas a Boo, a todos estos como consecuencia del proceso les queda una 'M' en la frente, la nave de Bididi consta de varios niveles cada uno de los cuales puede transportarse a cualquier parte del universo, avisados del peligro por el principe Kaioshin y su protector, Goku, Vegeta y Gohan van a la nave de Bibidi y pelean con varios de sus servidores, destaca ahi el gran poder que ha alcanzado Vegeta, quien por años se ha entrenado con Goku cada vez que el bajaba del cielo, Gohan pelea con Dabura pero no lo derrota, en eso Bididi toma en vista del gran poder de Vegeta lo toma para que también parte de él este en Majin Boo, y queda marcado en la frente, esto enfuerece a Vegeta, es ahí cuando Bididi, conocedor del fuerte sentimiento de envidia de Vegeta por Goku, los transporta al torneo, donde Vegeta enfurecido ataca a Goku y destruye parte del estadio. Despues Gohan, Vegeta, Piccolo y Krillin van a pelear contra Bibidi y Dabura, pero este es muy fuerte y con su escupitajo, convierte en piedra a Piccolo y a Krillin, se encuentra luchando contra Gohan cuando Boo es liberado, su actitud es de un niño, Dabura trata de atacarlo pero Boo de un solo golpe lo derrota, de ahi ataca aGohan y a KaioShin y los deja casi muertos, su poder es inmenso. Tiene que huir, Dabura vuelve y pelea contra Majin Boo, pero su cuerpo es como goma, los golpes no le hacen daño y no puede ser herido, Majin Boo con su poder lanza un rayo de su 'antena' y convierte a Dabura en una galleta y se lo come. Mientras toda la famila de los Saiyas son transportados a un lugar seguro para protegerlos de Majin Boo, Goku y Vegeta pelean para entrenarse y luchar contra Boo, pero Vegeta golpea a Goku por la espalda y parta a pelear él solo contra Majin Boo y se el un heroe, lo siguen Goten y Trunks, entonces lo que se habian convertido enpiedra por Dabura vuelven a ser normales una vez muerto él, Vegeta pelea contra Boo y si bien al comienzo parece derrotarlo con su gran poder, Boo se recupera comienza a ganarle al vez queno puede derrotarlo, Vegeta le dice a Piccolo que se lleve a Trunks su hijo y a Goten de ahí, entonces concentra su poder al máximo, mientras recuerda como Goku fue un heroe al morir en la pelea contra Cell, el no quiere ser menos, quiere ser mejor que Goku y destruir a Boo, cuando Boo se lanza al ataque, Vegeta suelta toda la energía que posee en una gran explosion dedetroza a Boo, tras lo cual sin energía y sin vida, solo queda como una estatua y cae al suelo destruyendosé, pero Boo no ha muerto sus pedazos se juntan y vuelve a aparecer sin el menordaño. Kaioshin es encontrado por su protector, y encuentran a Gohan y lo traslandan a su planeta donde, Goku lo encuentra y comienza a entrenarse en el uso de la Espada Z. En la Tierra Boo se vuelve amigo de Mister Satan al morir Bibidi, parte de Boo es buena y se enternece con un perrito, pero en un momento Boo se divide en sus dos persolidades, la buena y noble que es igual al anterior, rosado y gordo es Mr. Boo, pero la otra es un Boo cruel y malvado, purpura y flaco es Majin Boo, pelean y al final el malvado Boo se come el buen Boo y se vuelve fuerte y poderoso y de ahí parte a destruir a todos los de la familia de Goku. Para enfrentarlo estan Goten y Trunks que se unen mediante una danza mágica en una fusión de ambos para enfrentar a Boo, pero Boo logra llegar a donde están todos sus amigos y los convierte en comida y se los come a todos. Al final; Ro Kaito es liberado de la espada Z e incrementa el poder de Gohan. Al día siguiente,Boo destruye la tierra, pero Polunga (el dragón mágico de Namek) la reconstruye. Los habitantes de la tierra le dan toda su energía a Goku para que haga un Cho Gekindama, el cual elimina a Boo. Apareció la parte buena de Boo, conocida como Mr. Boo, que quedó en 2o lugar en los torneos 27 y 28, que los ganó Mr. Satán. Se casaron Gohan y la hija de Mr. Satán, Videl. Y tuvieron una hija llamada Pan. Nació Bra, hermana menor de Trunks. Pan derrotó en la final a su tío Goten en el 28° torneo de las Artes Marciales."
            }
        }
    },
    {
        "id": 3,
        "name": "Dragon Ball GT",
        "image": "dragon-ball-gt.jpg",
        "sagas": {
            "saga1": {
                "saga_name": "Saga del Gran Viaje",
                "description": "Han pasado 10 años desde el 28º Torneo de las Artes Marciales, Goku sigue entrenando a Uub en el Templo Sagrado. Pilaf, una vez más sigue en busca de las bolas de dragón para realizar su deseo y una vez lo logra invoca al dragón, que ahora es más grande y de color rojo. Pero cuando va a pedir el deseo, aparece Goku y Pilaf le grita que ojala volviera a ser pequeño por lo que el dragón interpreta este como su deseo y ¡Goku vuelve a ser pequeño! Las esferas que Pilaf usó para realizar el deseo no eran las normales, eran unas llamadas Esferas del Dragón definitivas y una vez usadas son esparcidas por todo el universo. Si no se logran reunir en un año nuevamente, el planeta donde fue pedido el deseo y concedido explotaría por lo que Bulma construye una nave para que Goku salieran en busca de las Bolas de Dragón. Trunks y Pan lo acompañaran, aunque Pan se cuela la nave y despega con ella por error. Realmente quien iba a acompañar a Goku sería Trunks y Goten pero Goten se queda en la tierra ya que despegan sin él. Tras varios problemas en la nave hacen un aterrizaje de emergencia en el Planeta Imega donde conocerán a Giru."
            },
            "saga2": {
                "saga_name": "Saga de Baby",
                "description": "El nuevo destino de Goku, Trunks y Pan es el Planeta Kelbo, donde Giru detecta una nueva bola de dragón. Esta bola pertenece a una princesa, Lemu, que les dará la Bola de Dragón si acaban con Zuhnamer, un monstruo. Finalmente no acaban con él, sino que harán que sirva a la princesa como detector sísmico. Después de todo esto, aparece un ser que les roba las Bolas de Dragón, descubriendo que son Bonpara, Donpara y Sonpara. El Dr Myu programó el nacimiento de Baby, un parásito creado para conquistar toda la galaxia. Baby se dirige a la Tierra donde infecta a casi todo el planeta. Baby lograr parasitar a varios personajes como Goten o Vegeta. En un enfrentamiento apasionante, Goku logra convertirse en Super Saiyan 4 llegando a hacer huir a Baby pero Goku lo impide con un Kamehameha enviándole directamente al sol, acabando así con Baby."
            },
            "saga3": {
                "saga_name": "Saga de Super Androide Nº17",
                "description": "Después de todo, se ha abierto un portal entre la Tierra y el Infierno producido por el Dr Myu y el Dr Gero con el cual pretenden apoderarse de la Tierra y el Universo. Para ello llevan 3 pasos: abrir un portal entre la Tierra y el Infierno, usando los poderes del Androide 17 y el Androide 17 del infierno, hacer volver a la Tierra a todos los villanos derrotados por Goku y sus amigos y encerrar a Goku en el infierno a través de una trampa haciéndole creer que va a pelear. Krilin moriría una vez más, a manos del Androide 17 al hacer recapacitar a su mujer Androide 18 de que no se una al malvado Androide 17 de nuevo. Después Androide 17 se fusionaría en nuevo androide dando lugar al Super Androide 17. Este nuevo androide es terriblemente fuerte e incluso casi acaba con Vegeta pero Goku lo impide aunque es derrotado por Super Androide 17 a pesar de haberse convertido en Super Saiyan 4. Finalmente, Goku se da cuenta que Super Androide 17 tiene una debilidad que es que mientras absorbe los ataque enemigos no puede atacar ni defender y es ahí cuando aprovecha para acabar con él con un Kamehameha."
            },
            "saga4": {
                "saga_name": "Saga de los Dragones Oscuros",
                "description": "Esta saga daría lugar al fin de Dragon Ball GT. Una vez Goku y sus amigos van a utilizar las Bolas de Dragón, se esparcen de nuevo por todo el universo. Después conocerían que tras el continuo uso de las Bolas de Dragón ha dado lugar a la aparición de siete dragones malignos que han surgido de la energía negativa que se ha producido con los deseo malos. Cada uno de estos dragones tiene un elemento, por lo que el objetivo de cada uno es recuperar su elemento para recuperar su forma completa. Goku y sus amigos lucharan de manera constante para acabar con cada uno de ellos y devolver todo a la normalidad. El más complicado de aniquilar de los 7 dragones es el dragón de una estrella que absorbe las esferas del dragón del resto de dragones logrando aumentar su poder de una manera increíble. Para derrotarlo Goku deberá realizar la fusión con Vegeta dando lugar a Súper Gogeta pero no lo logran de manera definitiva por lo que Goku deberá recurrir a la Genkidama y pedir la energía de todos los habitantes de la tierra para acabar con él. Después de todas las luchas y devolver todo a la normalidad, el verdadero Shen Long decide que no concederá más deseos en un largo tiempo aunque Goku logra poder solicitar un último deseo: revivir a todos los humanos que murieron cuando se abrió el portal entre el infierno y la Tierra durante el ataque del Súper Androide Número 17 y los dragones malignos. Pero todo esto sería a cambio de acompañar al dragón y marcharse poniendo así fin a la historia de las Bolas de Dragón."
            }
        }
    },
    {
        "id": 4,
        "name": "Dragon Ball Super",
        "image": "dragon-ball-super.jpg",
        "sagas": {
            "saga1": {
                "saga_name": "Saga de la Batalla de los Dioses",
                "description": "Esta saga comienza recordando el final de la batalla de Goku contra Buu en Dragon Ball Z pero pronto aparecerá Bills, el Dios de la Destrucción, que viene en busca del famoso Super Saiyan Dios. Mientras tanto, los amigos de Goku están a bordo de un barco, celebrando el cumpleaños de Bulma. Goku, se encuentra con Kaio del Norte entrenando, aunque Goku no sabía nada de que era el Super Saiyan Dios. Aparece Bills y tendrán un rápido enfrentamiento donde Goku es vencido fácilmente. Después acude al barco donde se enfrentará a Vegeta que también es vencido con mucha facilidad. Debido a esto, Bills decide destruir la Tierra pero en ese momento aparece Goku y le propone reunir las bolas de dragón para preguntarle por la existencia del Super Saiyan Dios, y Bills acepta. El Super Saiyan Dios es una mezcla de cinco Saiyans de corazón puro en uno solo. En ese momento no eran 5, aunque Videl confiesa en ese momento que está embarazada por lo que de esa manera logran ser 5 y Goku se transforma en Super Saiyan Dios teniendo un enfrentamiento increíble con Bills, aunque acaba derrotado por Bills."
            },
            "saga2": {
                "saga_name": "Saga de la Resurrección de Freezer",
                "description": "Una vez acabada la batalla con Beerus, Goku decide ir a entrenar con Kaio del Norte pero Chi-Chi le pide que vuelva a trabajar para ganar dinero. Vegeta también acudirá a entrenar pero con Whis convirtiéndose así en su discípulo. Goku, al enterarse también quiere ser entrenado por Whis y lo logra. Mientras tanto, Sorbet, el nuevo líder del ejército de Freezer, revive a Freezer con las bolas de dragón pero con el cuerpo destrozado ya que había sido partido en trozos por Trunks del Futuro en el pasado por lo que deben regenerarle. Una vez regenerado Freezer decide ir a la Tierra para vengarse de Goku. Cuando Freezer llega a la Tierra, Goku todavía no está ya que estaba entrenando con Whis y Vegeta. Mientras tanto Freezer y su ejército luchan contra los amigos de Goku generando el caos, hasta que llega Goku para contener la situación. Se vive un enfrentamiento muy duro. Freezer muestra su nueva transformación, Freezer dorado, generando un increíble poder pero Goku también muestra un increíble poder transformándose en Goku Super Saiyan Blue. Vegeta también lograría convertirse en Super Saiyan Blue. Tras un duro enfrentamiento, Freezer acaba destruyendo la Tierra pero gracias a Whis, regresan al pasado, impidiendo así la destrucción del planeta y acabando con Freezer."
            },
            "saga3": {
                "saga_name": "Saga del Torneo del Universo 6",
                "description": "Goku y Vegeta volverían al planeta de Beerus para seguir con su entrenamiento, pero allí aparecera el hermano de Beerus, Champa y su asistente Vados, petenecientes al Universo 6. Champa, al probar la comida de la Tierra quiere que sea suyo el planeta por lo que llegan un enfretamiento Beerus y Champa y deciden realizar un torneo entre los mejores guerreros de ambos Universos. Antes del torneo oficial se realiza una prueba donde luchará Mr. Buu. Después de la prueba da lugar el Torneo Universal comenzando el enfrentamiento Goku contra Botamo, donde Goku sale vencedor. El segundo combate será Goku contra Frost, el opuesto de Freezer, y Goku sería derrotado. El siguiente combate sería entonces Frost contra Piccolo, ganando una vez más el combate Frost. Es ahí cuando Jaco se da cuenta de que Frost tiene un arma en la mano, una especie de aguja, algo que es ilegal en el Torneo Universal por lo que Frost debería ser descalificado pero Vegeta pide que no lo sea para enfrentarse a él. Vegeta derrotaría con un solo golpe a Frost. Vegeta pasaría a enfrentarse ahora a Maggetta, un combate difícil para Vegeta por las condiciones en las que pelea pero acaba ganando la batalla pasando a pelear contra Cabba que es muy similar a él físicamente ya que también en un Saiyan. Vegeta derrota a Cabba pero éste le pide a Vegeta que le enseñe a transformarse en Super Saiyan y Vegeta le provoca ira para que lo logre. Después llegaría Hit, un sicario y el más fuerte del sexto universo. Vegeta no tendría ninguna opción contra él, por lo que ahora el turno sería de Goku. Goku se da cuenta de que Hit utiliza una técnica de control del tiempo, el salto temporal. Se ve un enfrentamiento espectacular entre Goku y Hit pero Goku acaba rindiéndose para así reanudar más tarde un combate sin reglas, por lo que el próximo luchador en enfrentarse a Hit sería Monaka, que para sorpresa de todos acabó con Hit de un solo golpe, ganando así el Torneo Universal el universo 7. Pero había truco, Hit se dejó ganar para así luchar contra Goku posteriormente. Champa enfadado por haber perdido el torneo, decide acabar con todos sus luchadores pero ene se mismo momento aparece Zeno, el Rey de Todo. Zeno confiesa que ha estado viendo todo el Torneo Universal organizado por Beerus y Champa y que le ha encantado y que él desea hacer otro pero esta vez con los doce universos."
            },
            "saga4": {
                "saga_name": "Saga de Goku Black",
                "description": "En una línea alternativa, un enemigo con una gran maldad está creando el caos en la Tierra. Trunks del Futuro, Bulma del Futuro y Mai del Futuro son los únicos sobrevivientes. Bulma construye una máquina del tiempo para que Trunks del Futuro vaya al pasado para poder resolver el problema que ha generado Goku Black, un ser físicamente igual a Goku. Pero antes de marchar, Goku Black asesina a Bulma. Cuando Trunks del Futuro llega al pasado, confude a Goku con Goku Black pero después del malentendido aparece de verdad Goku Black que ha seguido el rastro a Trunks del Futuro. Mantienen un duro enfrentamiento pero la energía oscura intenta llevarse de nuevo a Black pero antes de ser devuelto a la línea del futuro alternativa, destruye la máquina del tiempo en la que Trunks del Futuro había viajado al pasado. Pero Trunks tenía una salvación, Bulma poseía la máquina del tiempo en la que Cell había llegado. A partir de entonces, realizarán 3 viajes: En el primer viaje Trunks del Futuro, Vegeta y Goku son derrotados por Black con muchas heridas de gravedad. En este viaje Black se transforma en Super Saiyan Rosado y aparece Zamasdel presente como aliado de Goku Black.  En el segundo viaje acuden Trunks del Futuro, Vegeta, Goku y Bulma. Otra vez, Goku es herido de gravedad, pero logran conocer quien es Goku Black: Es Zamas del presente que gracias a un deseo que pidió a Super Shen Long logró cambiar los cuerpo con Goku. Además, mataría a su maestro Gowas. Después de todo viajó al futuro para aliarse con Zamas del Futuro. Todo esto lo hacía porque pensaba que la humanidad tiene muchos defectos y debe ser aniquilada a través del Plan Cero Humanos creando un nuevo mundo. En el tercer viaje Goku, Vegeta y Trunks intentan utilizar la técnica del Mafuba para acabar con Goku Black. Trunks realizará la técnica, sellándolo dentro de la jarra con ayuda de Mai, pero olvidaron el talismán mágico por lo que Zamas logra escapar, una vez más. Durante todo este enfrentamiento podremos ver la fusión de Vegeta y Goku, Vegetto pero no sería útil para acabar con Goku Black. Tendría que llegar Trunks y a través del ki de todos los presentes en la batalla y su espada parte por la mitad a Zamas. Pero después de «acabar» con Goku Black todo se llena de nubes negras con la cara de Zamas. En este momento, Goku decide utilizar el botón que le dio el Rey de Todo para resolver el problema pero el Rey de Todo acaba destruyendo todo el planeta. Goku y los demás lograrían huir al presente."
            },
            "saga5": {
                "saga_name": "Saga del Torneo del Poder",
                "description": "El Gran Sacerdote hace un anuncio de los Reyes de Todo. Estos están complacidos de que los luchadores de los universos con el rango más bajo humano han dado una lucha tan espléndida. El Gran Sacerdote continúa explicando cómo los reyes han clasificado cada universo por el nivel promedio de sus mundos habitados. El Universo 7 es penúltimo con una puntuación de 3,18, mientras que el Universo 9 en la parte inferior con un nivel medio de 1,86. El Gran Sacerdote continúa explicando, que en el próximo torneo, el Rey de Todo borrará los universos perdedores. Sin embargo, los Universos 1, 12, 5 y 8 están exentos de participar en el torneo ya que cada uno tiene un nivel humano con un promedio mayor a 7. El Rey de Todo piensa que hay demasiados universos, por lo que la idea de Goku para un torneo es la oportunidad perfecta para deshacerse de los universos mediocres. Whis se da cuenta de que en ese caso, los universos en el torneo son todos los que iban a ser destruidos de todos modos, y que al ganar tienen la oportunidad de salvarse. El Gran Sacerdote añade que los dioses serán destruidos junto con sus universos, mientras que sus ángeles no lo serán. El Universo 7 gana gracias a los esfuerzos de Goku y Freeza para eliminar a Jiren. El Androide Número 17 como el vencedor le pide a Super Shen Long que restaure los universos borrados. Tras estos eventos, el Gran Sacerdote declara que el Universo 7 fue el primer y único universo en escalar un puesto más dentro del índice de Nivel Humano, superando la cifra de 3,18 que tenían anteriormente y ascendiendo de la segunda a la tercera posición más baja, sobrepasando incluso al Universo 6, el cual ahora pasa al penúltimo lugar. Resulta que los Reyes de Todo esperaban que se pidiera este deseo y si el vencedor pedía otro deseo, en especial uno egoísta, los mismos Reyes de Todo borrarían absolutamente toda la existencia, cosa que fue revelada por el Gran Sacerdote a los dioses del Universo 7 tras la finalización del propio torneo."
            }
        }
    }
]