[
    {
        "id": 1,
        "name": "Dragon Ball",
        "image": "dragon-ball.jpg",
        "description": "La historia comienza en la Montaña Baozi, con un niño que tiene una cola de mono llamado Son Goku. Fue encontrado por un maestro de artes marciales llamado Son Gohan. Fue adoptado por él como su nieto y entrenado para llegar a ser un gran luchador. Tras la muerte de su abuelo adoptivo, Goku vive solo en la montaña y guarda como único recuerdo de su abuelo la esfera del dragón de cuatro estrellas que le dio antes de morir. Un día, después de terminar de cortar madera, Goku entró en su casa y vió brillar su esfera del dragón, y pensó que era su abuelo intentando hablarle. Luego salió en busca de comida, pero se encontró con un tigre dientes de sable que lo persigue hasta caer en un rio. Una vez que Goku salió del río, se quitó la ropa dejando que secase y se puso a pescar, por lo que metió su cola en el agua para usarla como cebo. Posteriormente un pez gigantesco vio su cola y pensó que era un mono, así que fue rápidamente hacía él, pero Goku lo noqueó de una patada. Después, Goku fue arrastrando el pez hacía su casa, pero en el trascurso fue atropellado por el coche de una adolescente llamada Bulma. Goku nunca había visto antes un coche, y pensó que era un monstruo. Entonces, lo agarró y lo lanzó a bastante distancia. En defensa propia, Bulma sacó una pistola y le disparó, pero debido a la gran fuerza y resistencia de Goku, las balas apenas le hicieron un poco de daño. Luego, Bulma sale del coche y se presenta como una chica humana, y no como un monstruo (como pensaba Goku). Después, Goku invita a Bulma a su casa (ya que su abuelo le había dicho que había que ser amable con las chicas) y Bulma ve la esfera del dragón de cuatro estrellas. Después de esto, Bulma le cuenta toda la historia de las Esferas del Dragón, relatando que al juntar las 7 esferas, Shen Long saldrá y le concederá cualquier deseo al que lo haya invocado. En ese momento, se cambia la escena y se nos muestra por primera vez a la Banda de Pilaf, los cuales entran en un templo para encontrar la Esfera del Dragón de una estrella. Bulma le comenta a Goku que quiere reunir las esferas para pedir un novio, pero Goku no quiere darle su esfera, al ver esto, Bulma intenta sobornar a Goku para que le entregue su esfera, a cambio, ella dejará que él le toque sus bragas, pero este no quiere. Al final, Bulma termina convenciendo a Goku de que la acompañe a buscar las demás esferas del dragón. Bulma le dice a Goku que con el Radar del Dragón podrán encontrar el resto de las esferas y le explica como funciona, aunque este no entiende nada; luego saca una pequeña capsula que al apretar un botón y lanzarla, explota y sale una moto, Goku queda y sorprendido y cree que ella es una bruja, pero esta le explica que en realidad es una cápsula. Al rato, hacen una parada para que Bulma vaya a orinar pero es capturada por un Pteranodon; Goku, que no entiende lo que esta sucediendo cree que el Pteranodon es un amigo de Bulma y se deja amarrar a un árbol, luego de entender todo, este se monta en la moto y sale persiguiendo al animal. Goku hace volar la moto al saltar por una colina y logra llegar a la altura del Pteranodon, que muere al recibir un gran golpe en la cabeza con el Báculo Mágico de Goku. Salvando así a Bulma. Con esto comenzarían enormes aventuras, enfrentando a poderosos enemigos y haciendo nuevos amigos."
    },
    {
        "id": 2,
        "name": "Dragon Ball Z",
        "image": "dragon-ball-z.jpg",
        "sagas": {
            "saga1" : {
                "name": "Saga de los Saiyajin",
                "description": "Dragon Ball Z retoma cinco años después del final del anime Dragon Ball, con Goku ahora un adulto joven y padre de su hijo, Gohan. Un extraterrestre humanoide llamado Raditz llega a la Tierra en una nave espacial y rastrea a Goku, revelándole que es su hermano mayor perdido hace mucho tiempo y que son miembros de una raza guerrera alienígena casi extinta llamada Saiyajin (サイヤ人, Saiya-jin) (conocido como 'Saiyan' en España). Los Saiyajin enviaron a Goku (originalmente llamado Kakaroto [カカロット, Kakarotto]) a la Tierra cuando era un bebé para conquistar el planeta para ellos, pero sufrió un fuerte golpe en la cabeza poco después de su llegada, y perdió todo recuerdo de su misión, así como su naturaleza Saiyajin sedienta de sangre. Raditz, junto con dos élites, Vegeta y Nappa, son los únicos guerreros Saiyajin que quedan, por lo que Raditz busca la ayuda de Goku para conquistar mundos fronterizos. Cuando Goku se niega a unirse a ellos, Raditz derriba a Goku y a Krilin de un solo golpe, secuestra a Gohan y amenaza con asesinarlo si Goku no mata a 100 humanos en las próximas 24 horas. Goku decide formar equipo con su archienemigo Piccolo, quien también fue derrotado por Raditz en un encuentro anterior, para derrotarlo y salvar a su hijo. Durante la batalla, la ira de Gohan lo hace momentáneamente más fuerte que Piccolo y Goku mientras ataca a Raditz para proteger a su padre. La batalla termina con Goku sujetando a Raditz por la espalda para que Piccolo pueda golpearlos con un movimiento mortal llamado Makankosappo (魔貫光殺砲, Makankōsappō, literalmente 'Demonio Atravesante, Rayo Asesino'), hiriendo mortalmente a ambos y matándolos casi al mismo tiempo después de un rato. Pero antes de que Raditz sucumba a sus heridas, le revela a Piccolo que los otros dos Saiyajin son mucho más fuertes que él y que vendrán por las Esferas del Dragón (conocidas como 'Bolas del Dragón' en España) en un año. Habiendo sido testigo del potencial latente de Gohan, Piccolo lo lleva al desierto para entrenarlo para la próxima batalla contra los Elites Saiyajin. En el más allá, Goku viaja por el Camino de la Serpiente de un millón de kilómetros para poder entrenar bajo el mando del gobernante de la Galaxia del Norte, Kaiosama (conocido como 'Kaito' en España). Kaiosama le enseña las técnicas Kaio-ken (界王拳, Kaiōken, literalmente 'Puño de los reyes de los mundos') y Genkidama (元気玉, Genki Dama, literalmente 'Esfera de energía'). A pesar de su naturaleza brusca, Piccolo se encariña con Gohan mientras lo supervisa aprendiendo a valerse por sí mismo. Esto forja un vínculo emocional improbable entre los dos. Pasado un año Goku revive con las Esferas del Dragón, pero Kaiosama entra en pánico cuando se da cuenta de que Goku tendrá que volver a ir por el Camino de la Serpiente nuevamente para regresar y no lo logrará hasta horas después de que lleguen los Saiyajin. Los aliados de Goku se agrupan para luchar hasta que Goku regrese, pero demuestran no ser rival para Nappa y el 'Príncipe de todos los Saiyajin', Vegeta. Yamcha, Ten Shin Han, Chaoz y Piccolo mueren en la batalla, y la muerte de Piccolo hace que tanto Kami Sama como las Esferas del Dragón desaparezcan. Cuando Goku finalmente llega al campo de batalla, venga a sus amigos caídos al derrotar fácilmente a Nappa antes de paralizarlo al partirle la columna por la mitad. Vegeta, furioso, ejecuta a Nappa por no haber matado a Goku. Goku usa varios grados del Kaio-ken para ganar el primer enfrentamiento con Vegeta, que concluye con una lucha culminante de choques de Kamehameha y Galick Ho respectivamente, pero tiene un gran costo para su cuerpo. Vegeta regresa y crea una luna artificial para transformarse en un gran mono Ozaru (similar a Goku de niño cuando tenía cola), que usa para torturar a Goku. Krilin y Gohan sienten que Goku está en problemas y regresan para una pelea grupal con el ahora aparentemente imparable Vegeta. Son ayudados en momentos clave por Yajirobe, quien corta la cola de Vegeta para que vuelva a su estado normal. Goku le da a Krilin una genkidama que él hizo, y Krilin la usa para dañar severamente a Vegeta. Vegeta finalmente es derrotado cuando es aplastado por la forma Ozaru de Gohan (quien había visto la luna artificial de Vegeta), y se retira a su nave espacial cuando Krilin se acerca para acabar con él con la espada de Yarijobe. Goku convence a Krilin para que perdone la vida de Vegeta y le permita escapar de la Tierra, con Vegeta prometiendo regresar y destruir el planeta en venganza por su humillación a manos de Goku."
            },
            "saga2": {
                "name": "Saga de Freezer",
                "description": ""
            }
        }
    },
    {
        "id": 3,
        "name": "Dragon Ball GT",
        "image": "dragon-ball-gt.jpg",
        "description": ""
    },
    {
        "id": 4,
        "name": "Dragon Ball Super",
        "image": "dragon-ball-super.jpg",
        "description": ""
    }
]